import numpy as np

arr = np.arange(2, 20).reshape([3, 3, 2])

print(arr)
# [[[ 2  3]
#   [ 4  5]
#   [ 6  7]]
#
#  [[ 8  9]
#   [10 11]
#   [12 13]]
#
#  [[14 15]
#   [16 17]
#   [18 19]]]

##########################
###### base funcs  #######
##########################

print(arr.min())
print(arr.max())
print(arr.sum())
print(arr.mean())
# 2
# 19
# 189
# 10.5

print(np.abs(np.array([[-1, 2, -3], [-2, 1, 3]])))
# [[1 2 3]
#  [2 1 3]]

#########################
###### math funcs #######
#########################

print(np.log(arr))  # логорифм
print(np.exp(arr))  # експанента
print(np.sin(arr))  # синус
print(np.cos(arr))
print(np.arctan(arr))

###########################################
###### math funcs по кокретным осям #######
###########################################
arr = np.arange(2, 20).reshape([3, 3, 2])

# print(arr.max())
print(np.max(arr, axis=0))
# print(arr.sum())
# [[14 15]
#  [16 17]
#  [18 19]]
print(np.sum(arr, axis=1))
# [[12 15]  : 2 + 4 + 6 = 12, 3 + 5 + 7 = 15
#  [30 33]
#  [48 51]]
print(np.mean(arr, axis=2))
# [[ 2.5  4.5  6.5] : (2+3)/2=5, (4+5)/2=4.5, (6+7)/2=6.5
#  [ 8.5 10.5 12.5]
#  [14.5 16.5 18.5]]

# КАК ПОНЯТЬ РАЗМЕРНОСТЬ у массива а выходе? - нжно убрать ось по которой провзводится вычиление,..  например исходящий массив(3, 3, 2), то
# - для print(np.max(arr, axis=0)) - нужно убрать первю ось и останется (3,2)
# - для print(np.mean(arr, axis=2)) - нужно убрать последнюю(2ую) ось и останется (3,3)
