#1 | Big O, сложность алгоритмов, поиск и сортировка массивов

#Зачем?
# - данные по разному устроены/организованы(ИХ СТРУКТУРА) и в зависимости от этого:
# - к задаче можно подойти по разному и разными спобами ее решить(ИХ АЛГОРИТМЫ)... а мы ж хотим хотим что это было все быстро!

# Что мы можем делать с данными?не так много, но мы можем их:
# - (READ)ЧИТАТЬ:
# -- в массиве какое-то значения
# -- в строке какою-то конкрутную букву ПО ИНДЕКСУ
# - (INSERT)СОЗДАВАТЬ или что-то добавлять: в массив,  строку и т.д.
# - (SEARCH)ПОИСК: потребуется понять на какой позиции находится то или иное значение
# - (DELETE)удалить значение из нашей структуры
#WARN: В РАЗНЫХ СТРУКТУРАХ ЭТИ ОПЕРАЦИИ БУДУТ РЕАЛИЗОВАНЫ ПО РАЗНОМУ

#Ответ: Поэтмоу нам нужно знать/понять:
# - какие бывают  структуры
# - на сколько в разных структурах эти ОПЕРАЦИИ БЫСТРЫЕ/оптимальные(не время, а сколько шагов требуется)


